CSI API ETABS v1
cDesignForces.ColumnDesignForces Method
 Retrieves design forces for an existing designed column
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ColumnDesignForces(
	string Name,
	ref int NumberResults,
	ref string[] FrameName,
	ref string[] ComboName,
	ref double[] Station,
	ref double[] P,
	ref double[] V2,
	ref double[] V3,
	ref double[] T,
	ref double[] M2,
	ref double[] M3,
	eItemType ItemType = eItemType.Objects
)
Function ColumnDesignForces (
	Name As String,
	ByRef NumberResults As Integer,
	ByRef FrameName As String(),
	ByRef ComboName As String(),
	ByRef Station As Double(),
	ByRef P As Double(),
	ByRef V2 As Double(),
	ByRef V3 As Double(),
	ByRef T As Double(),
	ByRef M2 As Double(),
	ByRef M3 As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignForces
Dim Name As String
Dim NumberResults As Integer
Dim FrameName As String()
Dim ComboName As String()
Dim Station As Double()
Dim P As Double()
Dim V2 As Double()
Dim V3 As Double()
Dim T As Double()
Dim M2 As Double()
Dim M3 As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.ColumnDesignForces(Name,
	NumberResults, FrameName, ComboName,
	Station, P, V2, V3, T, M2, M3, ItemType)
int ColumnDesignForces(
	String^ Name,
	int% NumberResults,
	array<String^>^% FrameName,
	array<String^>^% ComboName,
	array<double>^% Station,
	array<double>^% P,
	array<double>^% V2,
	array<double>^% V3,
	array<double>^% T,
	array<double>^% M2,
	array<double>^% M3,
	eItemType ItemType = eItemType::Objects
)
abstract ColumnDesignForces :
        Name : string *
        NumberResults : int byref *
        FrameName : string[] byref *
        ComboName : string[] byref *
        Station : float[] byref *
        P : float[] byref *
        V2 : float[] byref *
        V3 : float[] byref *
        T : float[] byref *
        M2 : float[] byref *
        M3 : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
NumberResults
Type: System.Int32
 The number of results, this is the length of all output arrays
FrameName
Type: System.String[]
 The frame name associated with each result
ComboName
Type: System.String[]
 The load combination for which the results are reported
Station
Type: System.Double[]
 The location, measured from the I-end of the frame object, where the results are reported [L]
P
Type: System.Double[]
 The design axial force in the frame object local 1-axis direction [F]
V2
Type: System.Double[]
 The design shear force in the frame object local 2-axis direction [F]
V3
Type: System.Double[]
 The design shear force in the frame object local 3-axis direction [F]
T
Type: System.Double[]
 The design torsional moment about the frame object local 1-axis [FL]
M2
Type: System.Double[]
 The design bending moment about the frame object local 2-axis [FL]
M3
Type: System.Double[]
 The design bending moment about the frame object local 3-axis [FL]
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, results are retrieved for the frame object specified by the Name item.
 If this item is Group, results are retrieved for all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, results are retrieved for all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the results are successfully retrieved, otherwise it returns a nonzero value.
See Also
Reference
cDesignForces Interface
ETABSv1 Namespace